{
   "13" : {
      "Name" : "Siu Hon Leung",
      "Value" : "0",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Description" : "Mr. Leung Siu Hon is the Non-Executive Director of CK Hutchison Holdings Limited. He has been a Director of Cheung Kong (Holdings) Limited since 1984 and is currently a Non-executive Director of Cheung Kong. He was an Independent Non-executive Director of Cheung Kong prior to his re-designation as a Non-executive Director of Cheung Kong in September 2004. Mr. Leung holds a B.A. Law (Honors) (Southampton) degree, and has been awarded the Honorary degree of Doctor of Laws by the University of Southampton in July 2001 and appointed by the Northwest University of Politics & Law, China to the post of Adjunct Professor in May 2014. Mr. Leung is a solicitor of the High Court of the Hong Kong Special Administrative Region and an attesting officer appointed by the PRC. He is presently a consultant of Messrs. S.H. Leung and Co., Solicitors.",
      "Age" : "83",
      "Current Position" : "Non-Executive Director",
      "Since" : "2015",
      "order" : "13"
   },
   "6" : {
      "Age" : "61",
      "Current Position" : "Deputy Managing Director, Executive Director",
      "Description" : "Mr. Lai Kai Ming, Dominic is Deputy Managing Director, Executive Director of the Company. Mr Lai, BSc, MBA has been appointed as an Executive Director and Deputy Managing Director of CKH Holdings with effect from 3 June 2015. He is an Executive Director of Hutchison, a Non-executive Director of HTHKH and a Director of HTAL. He is also an Alternate Director to Directors of each of HTHKH and HTAL. Mr Lai was previously Deputy Chairman, an Executive Director and an Alternate Director to Directors of HHR (now known as China Oceanwide Holdings Limited) (resigned on 19 December 2014). Except for Hutchison, all the companies mentioned above are listed in Hong Kong or overseas. Mr Lai has over 30 years of management experience in different industries. He holds a Bachelor of Science (Hons) degree and a Master?s degree in Business Administration.",
      "order" : "6",
      "Since" : "2015",
      "Name" : "Kai Ming Lai",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0"
   },
   "20" : {
      "order" : "20",
      "Since" : "2015",
      "Age" : "82",
      "Current Position" : "Independent Non-Executive Director",
      "Description" : "Mr. Wong Chung Hin is Independent Non-Executive Director of the Company. He is an Independent Non-executive Director of Hutchison, The Bank of East Asia, Limited and Power Assets. Except for Hutchison, all the companies mentioned above are listed in Hong Kong. He is a solicitor.",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Name" : "Chung Hin Wong"
   },
   "7" : {
      "Since" : "",
      "order" : "7",
      "Description" : "Mr. Man Ka Keung is the General Manager - Accounts Department of CK Hutchison Holdings Limited. He joined the Group in December 1987. He is the Alternate Director to Mr. Ip Tak Chuen, Edmond, Deputy Chairman and Executive Director of Cheung Kong Infrastructure Holdings Limited and a Director of Harbour Plaza Hotel Management Limited. He has over 33 years of experience in accounting, auditing, tax and finance. He holds a Bachelor?s degree in Economics and is an associate member of The Institute of Chartered Accountants in Australia.",
      "Age" : "57",
      "Current Position" : "General Manager - Accounts Department",
      "Value" : "0",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Name" : "Ka Keung Man"
   },
   "4" : {
      "Description" : "Mr. Ip Tak Chuen is the Deputy Managing Director, Executive Director of CK Hutchison Holdings Limited. He has been an Executive Director and Deputy Managing Director of Cheung Kong Property Holdings Limited since 26th February, 2015. He has been an Executive Director of Cheung Kong (Holdings) Limited since 1993, Deputy Managing Director of Cheung Kong since 2005 and a Member of the Executive Committee of Cheung Kong since March 2013. He is also an Executive Director and Deputy Chairman of Cheung Kong Infrastructure Holdings Limited, the Senior Vice President and Chief Investment Officer of CK Life Sciences Int?l., (Holdings) Inc., a Non-executive Director of ARA Asset Management Limited (an Asian real estate fund management company listed in Singapore), TOM Group Limited, AVIC International Holding (HK) Limited, Real Nutriceutical Group Limited, Shougang Concord International Enterprises Company Limited. Except for CK Property and Cheung Kong, a l l the companies mentioned above are listed companies. Mr. Ip is also a Non-executive Director of ARA Asset Management (Fortune) Limited as the manager of Fortune REIT (listed in Hong Kong and Singapore) and Hui Xian Asset Management Limited as the manager of Hui Xian REIT (listed in Hong Kong). He holds a Bachelor of Arts degree in Economics and a Master of Science degree in Business Administration. Mr. Ip is a director of certain companies controlled by certain substantial shareholders of the Company within the meaning of Part XV of the Securities and Futures Ordinance.",
      "Current Position" : "Deputy Managing Director, Executive Director",
      "Age" : "64",
      "Since" : "2015",
      "order" : "4",
      "Name" : "Tak Chuen Ip",
      "Value" : "0",
      "Options" : "0",
      "Fiscal Year Total" : "28,880,000"
   },
   "5" : {
      "Since" : "2015",
      "order" : "5",
      "Age" : "69",
      "Current Position" : "Deputy Managing Director, Executive Director",
      "Description" : "Mr. Kam Hing Lam is the Deputy Managing Director, Executive Director of CK Hutchison Holdings Limited. He has also been an Executive Director and Deputy Managing Director of Cheung Kong Property Holdings Limited since 26th February, 2015. Mr. Kam has been Deputy Managing Director of Cheung Kong (Holdings) Limited since 1993 and a Member of the Executive Committee of Cheung Kong since March 2013. He is also the Group Managing Director of Cheung Kong Infrastructure Holdings Limited, the President and Chief Executive Officer of CK Life Sciences Int?l., (Holdings) Inc., and an Executive Director of Hutchison Whampoa Limited. Except for CK Property and Cheung Kong, all the companies mentioned above are listed companies. He is also the Chairman of Hui Xian Asset Management Limited as the manager of Hui Xian REIT (listed in Hong Kong) and a Director of Australian Gas Networks Limited (formerly known as Envestra Limited, whose shares were withdrawn from listing on 17th October, 2014). Mr. Kam is an Advisor of the 12th Beijing Municipal Committee of the Chinese People?s Political Consultative Conference of the People?s Republic of China. He holds a Bachelor of Science degree in Engineering and a Master?s degree in Business Administration.",
      "Fiscal Year Total" : "23,570,000",
      "Options" : "0",
      "Value" : "0",
      "Name" : "Hing Lam Kam"
   },
   "8" : {
      "Name" : "Edith Shih",
      "Value" : "0",
      "Options" : "0",
      "Fiscal Year Total" : "--",
      "Description" : "Ms. Edith Shih has been appointed as the Company Secretary of the Company. She is also been appointed as Executive Director of the Company, with effect from 1 January 2017. She is currently the Head Group General Counsel and Company Secretary of the Company. She oversees legal, corporate finance, regulatory, compliance and corporate governance affairs of the CK Hutchison Group (the ?Group?). She is a Non-executive Director of Hutchison China MediTech Limited, an approximately 60% held subsidiary of the Company, the shares of which are traded on the AIM, a market regulated by the London Stock Exchange, and in the form of American Depositary Shares on the NASDAQ Stock Market; as well as director and company secretary of various subsidiaries and associated companies of the Company. Ms Shih was Executive Director of Hutchison Harbour Ring Limited (?HHR?, now known as China Oceanwide Holdings Limited, the shares of which are listed on the main board of The Stock Exchange of Hong Kong Limited (the ?Stock Exchange?)) during the previous three years. Ms Shih is a qualified solicitor in England and Wales, Hong Kong and Victoria, Australia and a Fellow of both the Institute of Chartered Secretaries and Administrators in the United Kingdom and The Hong Kong Institute of Chartered Secretaries. She holds a Bachelor of Science degree in Education and a Master of Arts degree from the University of the Philippines and a Master of Arts degree and a Master of Education degree from Columbia University, New York.",
      "Current Position" : "Executive Director, Company Secretary",
      "Age" : "64",
      "order" : "8",
      "Since" : "2017"
   },
   "19" : {
      "Since" : "2015",
      "order" : "19",
      "Age" : "84",
      "Current Position" : "Independent Non-Executive Director",
      "Description" : "Mr. William Shurniak, SOM, Ph.D. LL.D. (Hon) has been appointed as Independent Non-Executive Director of the Company. He is an Independent Non-executive Director of Hutchison. In addition, he is a Director (independent) and Deputy Chairman of Husky, being a listed company. He has broad banking experience and he holds Honorary Doctor of Laws degrees from the University of Saskatchewan, The University of Western Ontario and the University of Regina in Canada. He was awarded the Saskatchewan Order of Merit by the Government of Saskatchewan in 2009 and the Queen Elizabeth II Diamond Jubilee Medal by the Lieutenant Governor of Saskatchewan in 2012.",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Name" : "William Shurniak"
   },
   "12" : {
      "Since" : "2015",
      "order" : "12",
      "Description" : "Mr. Lee Yeh Kwong, OBE, is the Non-Executive Director of CK Hutchison Holdings Limited. Mr. Charles Lee has been a Non-executive Director of Cheung Kong (Holdings) Limited since 2013. He was a Director of Cheung Kong during the period from August 1972 to March 1997. Mr. Charles Lee has also been a Non-executive Director of Hutchison Whampoa Limited since 2013. He is also the Chairperson of Hong Kong ? Taiwan Economic and Cultural Co-operation and Promotion Council, and a Board Member and Campaign Committee Co-Chairman o f The Community Chest of Hong Kong. Mr. Charles Lee is one of the founders of the solicitor?s firm Woo, Kwan, Lee & Lo, a major law firm in Hong Kong. He holds a Master?s degree in law and is a qualified solicitor in both Hong Kong and the United Kingdom. He was awarded the degree of Doctor of Laws honoris causa by The Hong Kong University of Science and Technology, the degree of Doctor of Business Administration by The Hong Kong Polytechnic University and the degree of Doctor of Social Sciences, honoris causa by the University of Hong Kong and The Open University of Hong Kong respectively. He is also a qualified accountant and a chartered secretary.",
      "Current Position" : "Non-Executive Director",
      "Age" : "78",
      "Value" : "0",
      "Options" : "0",
      "Fiscal Year Total" : "--",
      "Name" : "Yeh Kwong Lee"
   },
   "9" : {
      "Name" : "Kun Chee Chow",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Age" : "77",
      "Current Position" : "Non-Executive Director",
      "Description" : "Mr. Chow Kun Chee is the Non-Executive Director of CK Hutchison Holdings Limited. He has been a Director of Cheung Kong (Holdings) Limited since 1993 and is currently a Non-executive Director of Cheung Kong. He was an Independent Non-executive Director of Cheung Kong prior to his re-designation as a Non-executive Director of Cheung Kong in September 2004. Mr. Chow is a solicitor of the High Court of the Hong Kong Special Administrative Region and is a consultant of Messrs. Herbert Tsoi and Partners, Solicitors. Mr. Chow is a cousin of Mr. Leung Siu Hon, a Non-executive Director of the Company. Mr. Chow is a director of certain substantial shareholders of the Company within the meaning of Part XV of the Securities and Futures Ordinance, and a director of certain companies controlled by certain substantial shareholders of the Company. He holds a Master of Laws degree from the University of London.",
      "order" : "9",
      "Since" : "2015"
   },
   "16" : {
      "Name" : "Michael Kadoorie",
      "Value" : "0",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Description" : "The Hon. Sir Michael David Kadoorie, GBS, LLD (Hon), DSc (Hon), Commandeur de la L?gion d?Honneur, Commandeur de l?Ordre de Leopold II, Commandeur de l?Ordre des Arts et des Lettres has been appointed as Independent Non-Executive Director of the Company, with effect from 3 June 2015. He is an Independent Non-executive Director of Hutchison, Chairman of CLP Holdings Limited (?CLP?) and The Hongkong and Shanghai Hotels, Limited (?Shanghai Hotels?), as well as Heliservices (Hong Kong) Limited (?Heliservices?). He is also an Alternate Director to a Director of Hong Kong Aircraft Engineering Company Limited. Except for Heliservices and Hutchison, all the companies mentioned above are listed in Hong Kong.",
      "Age" : "75",
      "Current Position" : "Independent Non-Executive Director",
      "order" : "16",
      "Since" : "2015"
   },
   "17" : {
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Name" : "Tun-li Kwok",
      "Since" : "2015",
      "order" : "17",
      "Age" : "88",
      "Current Position" : "Independent Non-Executive Director",
      "Description" : "Mr. Kwok Tun-li is an Independent Non-Executive Director of CK Hutchison Holdings Limited. He has been a Director of Cheung Kong (Holdings) Limited since 1989 and is currently an Independent Non-executive Director, a member of the Audit Committee and the Remuneration Committee of Cheung Kong. Mr. Kwok holds a Bachelor?s degree in Science (Architecture) from St. John?s University, Shanghai, China, and an A.A. Diploma from the Architectural Association School of Architecture, London, England. He is also presently a Director of Amara Holdings Inc., CTBC Bank Corp. (Canada) (formerly known as CTC Bank of Canada), Husky Energy Inc., a listed company, and Stanley Kwok Consultants Inc."
   },
   "18" : {
      "Since" : "2015",
      "order" : "18",
      "Age" : "64",
      "Current Position" : "Independent Non-Executive Director",
      "Description" : "Ms. Lee Wai Mun, Rose is Independent Non-Executive Director of the Company. She is an Independent Non-executive Director of Hutchison, an Executive Director, Vice-chairman and Chief Executive of Hang Seng Bank Limited, being a listed company, and Chairman and a member of its Executive Committee and Nomination Committee respectively. Ms Lee is also the Chairman of Hang Seng Bank (China) Limited. Ms Lee is a Group General Manager of HSBC Holdings plc, being a listed company, a Director of The Hongkong and Shanghai Banking Corporation Limited, an Independent Nonexecutive Director of Swire Pacific Limited, being a listed company, Chairman of the Board of Governors of Hang Seng Management College, Chairman of the Board of Directors of Hang Seng School of Commerce, Second Vice President and Board Member of The Community Chest of Hong Kong as well as Chairman of its Campaign Committee and a member of its Executive Committee, Vice-chairman of the Finance Professional Committee of Guangdong?s Association for Promotion of Cooperation between Guangdong, Hongkong & Macao, Vice President of The Hong Kong Institute of Bankers, a member of the Inaugural Financial Consulting Committee for Authority of Qianhai Shenzhen ? Hong Kong Modern Service Industry Cooperation Zone of Shenzhen, a member of the Advisory Committee of the New College of Jockey Club Student Village III of the University of Hong Kong, a member of the Court of The Hong Kong University of Science and Technology, a member of the Board of Trustees of Ho Leung Ho Lee Foundation and a member of the Financial Services Advisory Committee of Hong Kong Trade Development Council. Ms Lee holds a Bachelor?s degree in Business Administration.",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Name" : "Wai Mun Lee"
   },
   "10" : {
      "Description" : "Mrs. Chow Woo Mo Fong, Susan has been appointed as Non-executive Director of the Company with effect from 1 January 2017. She is currently Senior Advisor of the Company. She was an Executive Director and Group Deputy Managing Director of the Company from 2015 to July 2016, and was Executive Director of HWL from 1993 to June 2015, Deputy Group Managing Director of HWL from 1998 to June 2015 and Director of HWL from June 2015 to July 2016. Prior to joining HWL, Mrs Chow was a partner of Woo, Kwan, Lee & Lo, a major law firm in Hong Kong. Mrs Chow is an Alternate Director to a Director of Cheung Kong Infrastructure Holdings Limited (?CKI?), HK Electric Investments Manager Limited (?HKEIM?) as the trustee-manager of HK Electric Investments (?HKEI?), and HK Electric Investments Limited (HKEIL?). She was an Executive Director of CKI, Power Assets Holdings Limited (?Power Assets?), HHR, HKEIM as the trustee-manager of HKEI, and HKEIL, a Non-executive Director of Hutchison Telecommunications Hong Kong Holdings Limited, a Director of Hutchison Telecommunications (Australia) Limited (?HTAL?) and an Alternate Director to Directors of CKI, HTAL, Power Assets and TOM Group Limited during the previous three years. Except for HWL and HKEIM, all the companies/investment trust mentioned above are listed in Hong Kong or overseas. Mrs Chow is a qualified solicitor and holds a Bachelor?s degree in Business Administration. Mrs. Chow is at present a member of the Court of the Hong Kong University of Science and Technology and a member of the Appeal Boards Panel (Education). She previously served as a member of the Listing Committee of the Stock Exchange, the Joint Liaison Committee on Taxation of the Law Society of Hong Kong, the Committee on Real Estate Investment Trusts of the Securities and Futures Commission and the Trade and Industry Advisory Board.",
      "Current Position" : "Non-Executive Director",
      "Age" : "63",
      "order" : "10",
      "Since" : "2017",
      "Name" : "Woo Mo Fong Chow",
      "Value" : "0",
      "Options" : "0",
      "Fiscal Year Total" : "--"
   },
   "2" : {
      "order" : "2",
      "Since" : "2015",
      "Current Position" : "Group Finance Director, Deputy Managing Director, Executive Director",
      "Age" : "65",
      "Description" : "Mr. Frank John Sixt is Group Finance Director, Deputy Managing Director, Executive Director of CK Hutchison Holdings Limited. He is the Non-executive Chairman of TOM Group Limited, the Group Finance Director of Hutchison Whampoa Limited and an Executive Director of Cheung Kong Infrastructure Holdings Limited. He is also a Non-executive Director of Hutchison Telecommunications Hong Kong Holdings Limited, Hutchison Port Holdings Management Pte. Limited (?HPHM?) as the trustee-manager of Hutchison Port Holdings Trust, and Power Assets Holdings Limited, a Director of Hutchison Telecommunications (Australia) Limited and Husky Energy Inc., and an Alternate Director of Hutchison Telecommunications (Australia) Limited. Except for Cheung Kong and HPHM, all the companies/business trust mentioned above are listed in Hong Kong or overseas. In addition, Mr. Sixt is a director of certain substantial shareholders of the Company within the meaning of Part XV of the Securities and Futures Ordinance, and a director of certain companies controlled by certain substantial shareholders of the Company. He holds a Master?s degree in Arts and a Bachelor?s degree in Civil Law, and is a member of the Bar and of the Law Society of the Provinces of Qu?bec and Ontario, Canada.",
      "Options" : "0",
      "Fiscal Year Total" : "--",
      "Value" : "0",
      "Name" : "Frank Sixt"
   },
   "21" : {
      "Name" : "Yick-ming Wong",
      "Value" : "0",
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Description" : "Ms. Wong Yick-ming is an Independent Non-Executive Director of CK Hutchison Holdings Limited. She has been an Independent Non-executive Director of Cheung Kong (Holdings) Limited since 2001 and a member of the Remuneration Committee of Cheung Kong since 2005. She has been the Chairman of the Remuneration Committee of Cheung Kong since 1st January, 2012. She holds a Doctor of Philosophy degree in Sociology from the University of California (Davis), U.S.A. and has been awarded Honorary Doctorates by The Chinese University of Hong Kong, The Hong Kong Polytechnic University, the University of Hong Kong, The Hong Kong Institute of Education and University of Toronto in Canada. She is currently a member of the 12th National Committee of the Chinese People?s Political Consultative Conference of the People?s Republic of China. She is a Member of The Hong Kong University of Science and Technology Business School Advisory Council, an elected Member of the Council and an ex-officio Member of the Court of the University of Hong Kong. She also serves as a Global Advisor to Mars, Incorporated. She is the Executive Director of The Hong Kong Federation of Youth Groups, the Non-executive Chairman of The Hongkong Bank Foundation?s Advisory Committee, a Non-executive Director of The Hongkong and Shanghai Banking Corporation Limited and an Independent Non-executive Director of Hutchison Telecommunications Hong Kong Holdings Limited and The Hongkong and Shanghai Hotels, Limited, both being listed companies. She was previously a member of the Commission on Poverty of the Government of the Hong Kong Special Administrative Region.",
      "Age" : "62",
      "Current Position" : "Independent Non-Executive Director",
      "order" : "21",
      "Since" : "2015"
   },
   "15" : {
      "Current Position" : "Independent Non-Executive Director",
      "Age" : "68",
      "Description" : "Mr. Cheng Hoi Chuen (Vincent) is Independent Non-Executive Director of the Company. He has been appointed as an Independent Non-executive Director and a member of both the Audit Committee and the Remuneration Committee of CKH Holdings with effect from 3 June 2015. He is an Independent Non-executive Director of Hutchison, MTR Corporation Limited, Great Eagle Holdings Limited, CLP Holdings Limited, Hui Xian Asset Management Limited (?HXAML?) as manager of Hui Xian Real Estate Investment Trust, China Minsheng Banking Corp., Ltd., Shanghai Industrial Holdings Limited and Wing Tai Properties Limited. He was previously an Independent Non-executive Director of Swire Properties Limited (resigned on 14 April 2012). Except for HXAML and Hutchison, all the companies/investment trust mentioned above are listed in Hong Kong.",
      "Since" : "2015",
      "order" : "15",
      "Name" : "Hoi-Chuen Cheng",
      "Options" : "0",
      "Fiscal Year Total" : "--",
      "Value" : "0"
   },
   "1" : {
      "Since" : "2015",
      "order" : "1",
      "Current Position" : "Executive Deputy Chairman of the Board, Group Co-Managing Director",
      "Age" : "51",
      "Description" : "Mr. Li Tzar Kuoi, LL.D., is Executive Deputy Chairman of the Board, Group Co-Managing Director of CK Hutchison Holdings Limited. Mr. Victor Li joined the Group in 1985. He acted as Deputy Managing Director of Cheung Kong (Holdings) Limited from 1993 to 1998. He has been Deputy Chairman of Cheung Kong since 1994, Managing Director of Cheung Kong since 1999 and the Chairman of the Executive Committee of Cheung Kong since March 2013. He is also the Deputy Chairman of Hutchison Whampoa Limited, the Chairman of Cheung Kong Infrastructure Holdings Limited and CK Life Sciences Int?l.,(Holdings) Inc., a Non-executive Director and the Deputy Chairman of HK Electric Investments Limited, a Non-executive Director of Power Assets Holdings Limited and HK Electric Investments Manager Limited (?HKEIM?), which is the trustee-manager of HK Electric Investments, and Co-Chairman of Husky Energy Inc. Except for CK Property, Cheung Kong and HKEIM, all the companies/investment trust mentioned above are listed in Hong Kong or overseas. Mr. Victor Li is also the Deputy Chairman of Li Ka Shing Foundation Limited, Li Ka Shing (Overseas) Foundation and Li Ka Shing (Canada) Foundation, and a Director of The Hongkong and Shanghai Banking Corporation Limited. Mr. Victor Li serves as a member of the Standing Committee of the 12th National Committee of the Chinese People?s Political Consultative Conference of the People?s Republic of China. He is also a member of the Commission on Strategic Development of the Hong Kong Special Administrative Region (?HKSAR?) and Vice Chairman of the Hong Kong General Chamber of Commerce. Mr. Victor Li is the Honorary Consul of Barbados in Hong Kong. He was previously a member of the Council for Sustainable Development of the HKSAR. He holds a Bachelor of Science degree in Civil Engineering, a Master of Science degree in Civil En",
      "Options" : "0",
      "Fiscal Year Total" : "69,660,000",
      "Value" : "0",
      "Name" : "Tzar Kuoi Li"
   },
   "14" : {
      "Since" : "2015",
      "order" : "14",
      "Description" : "Mr. George Colin Magnus, OBE, is the Non-Executive Director of CK Hutchison Holdings Limited. He acted as an Executive Director of Cheung Kong (Holdings) Limited from 1980 and Deputy Chairman of Cheung Kong from 1985 until he retired from these offices in October 2005. He has been a Non-executive Director of Cheung Kong since November 2005. He has been a Director of Hutchison Whampoa Limited (?HWL?) since 1980. He served as Deputy Chairman of HWL from 1984 to 1993 and is currently a Non-executive Director of HWL. He is also a Non-executive Director of Cheung Kong Infrastructure Holdings Limited, an Independent Non-executive Director of HK Electric Investments Manager Limited (?HKEIM?) as the trustee-manager of HK Electric Investments, and HK Electric Investments Limited, and a Director of Husky Energy Inc.. Except for Cheung Kong and HKEIM, all the companies/investment trust mentioned above are listed in Hong Kong or overseas. He holds a Master?s degree in Economics from King?s College of the University of Cambridge.",
      "Current Position" : "Non-Executive Director",
      "Age" : "80",
      "Value" : "0",
      "Options" : "0",
      "Fiscal Year Total" : "--",
      "Name" : "George Magnus"
   },
   "11" : {
      "Description" : "Mrs. Chow Woo Mo Fong has been appointed as the Non-Executive Director of the Company, effective 01, January 2017. She is Deputy Group Managing Director of Hutchison, an Executive Director of CKI, a Non-executive Director of HTHKH and a Director of HTAL. She is also an Alternate Director to Directors of each of CKI, HTAL, HKEIM as the trustee-manager of HKEI, HKEIL and TOM Group Limited (?TOM?). Except for HKEIM and Hutchison, all the companies/investment trust mentioned above are listed in Hong Kong or overseas. She is a qualified solicitor and holds a Bachelor?s degree in Business Administration. Mrs Chow was previously an Executive Director and an Alternate Director to Directors of Power Assets (resigned on 29 January 2014), an Executive Director of HHR (now known as China Oceanwide Holdings Limited) (resigned on 19 December 2014), HKEIM as the trusteemanager of HKEI, and HKEIL (both resigned on 28 November 2014) and an Alternate Director to a Director of HPHM as the trustee-manager of HPH Trust (resigned on 24 October 2012). Except for HKEIM and HPHM, all the companies/business trust/investment trust mentioned above are listed in Hong Kong or overseas.",
      "Age" : "62",
      "Current Position" : "Non-Executive Director",
      "order" : "11",
      "Since" : "2017",
      "Name" : "Mo Fong Chow Woo",
      "Value" : "0",
      "Fiscal Year Total" : "--",
      "Options" : "0"
   },
   "3" : {
      "Fiscal Year Total" : "--",
      "Options" : "0",
      "Value" : "0",
      "Name" : "Kin Ning Fok",
      "Since" : "2015",
      "order" : "3",
      "Age" : "64",
      "Current Position" : "Group Co-Managing Director, Executive Director",
      "Description" : "Mr. Fok Kin Ning is Group Co-Managing Director, Executive Director of CK Hutchison Holdings Limited. He has been a Director of Cheung Kong (Holdings) Limited since 1985 and is currently a Non-executive Director of Cheung Kong. Mr. Fok is also the Group Managing Director of Hutchison Whampoa Limited and Deputy Chairman of Cheung Kong Infrastructure Holdings Limited. He is also the Chairman of Hutchison Telecommunications Hong Kong Holdings Limited, Hutchison Telecommunications (Australia) Limited, Hutchison Port Holdings Management Pte. Limited (?HPHM?) as the trustee-manager of Hutchison Port Holdings Trust, Power Assets Holdings Limited, HK Electric Investments Manager Limited (?HKEIM?) as the trustee-manager of HK Electric Investments, and HK Electric Investments Limited, Co-Chairman of Husky Energy Inc. He was previously the Chairman of Hutchison Harbour Ring Limited (now known as China Oceanwide Holdings Limited). Except for Cheung Kong, HPHM and HKEIM, all the companies/business trust/investment trust mentioned above are listed in Hong Kong or overseas. He holds a Bachelor of Arts degree and a Diploma in Financial Management, and is a member of The Institute of Chartered Accountants in Australia. Mr. Fok is a director of certain companies controlled by a substantial shareholder of the Company within the meaning of Part XV of the Securities and Futures Ordinance."
   },
   "0" : {
      "Name" : "Ka-shing Li",
      "Options" : "0",
      "Fiscal Year Total" : "10,000",
      "Value" : "0",
      "Current Position" : "Executive Chairman of the Board",
      "Age" : "87",
      "Description" : "Mr. Li Ka-shing is the Executive Chairman of the Board of CK Hutchison Holdings Limited. He is the founder of the Group. Mr. Li has also been the Chairman of Cheung Kong Property Holdings Limited (?CK Property?) and a member of the Remuneration Committee of CK Property since 26th February, 2015. He has been the Chairman of Cheung Kong (Holdings) Limited (?Cheung Kong?) since 1971 and acted as the Managing Director of Cheung Kong from 1971 to 1998. He has been a member of the Remuneration Committee of Cheung Kong since March 2005. Mr. Li has also been the Chairman of Hutchison Whampoa Limited, a listed company, since 1981, and is the Chairman of Li Ka Shing Foundation Limited, Li Ka Shing (Overseas) Foundation and Li Ka Shing (Canada) Foundation. He has been engaged in many major commercial developments in Hong Kong for more than 60 years. Mr. Li served as a member of the Hong Kong Special Administrative Region?s Basic Law Drafting Committee, Hong Kong Affairs Adviser and the Preparatory Committee for the Hong Kong Special Administrative Region. He is also an Honorary Citizen of a number of cities on the Mainland and overseas. Mr. Li is a keen supporter of community service organisations, and has served as honorary chairman of many such groups over the years. Mr. Li has received Honorary Doctorates from Peking University, the University of Hong Kong, The Hong Kong University of Science and Technology, The Chinese University of Hong Kong, City University of Hong Kong, The Open University of Hong Kong, University of Calgary in Canada and Cambridge University in the United Kingdom. Mr. Li has been awarded Entrepreneur of the Millennium, the Carnegie Medal of Philanthropy and The Berkeley Medal. He is the recipient of many other major honors and awards from renowned institutions on the Mainland and abroad. Mr. Li Ka-shing also holds directorships in certain companies controlled by certain substantial shareholders of the Company within the meaning of Part XV of the Securities and Futures Ordinance.",
      "Since" : "2015",
      "order" : "0"
   }
}
